Autodesk.Revit.DB.InSessionPrintSetting.PrintParameters
Returns the Parameters of Print Setup.
Remarks: The Parameters of Print Setup. Refer to the Print Setup dialog in Revit for details.

Autodesk.Revit.DB.InSessionPrintSetting
Represents the in-session Print Setup (Application Menu->Print->Print Setup) within Autodesk Revit.
Remarks: The in-session PrintSetting can't be stored in document.